<?php
return [

    // +----------------------------------------------------------------------
    // | 数据库设置
    // +----------------------------------------------------------------------

	'db'                   => [
	    // 服务器地址
		'host'      => getenv('DB_HOST') ?: 'localhost',
		// 服务器端口
		'port'      => getenv('DB_PORT') ?: '3306',
		// 用户
		'user'      => getenv('DB_USER') ?: '',
		// 密码
		'pw'        => getenv('DB_PASSWORD') ?: '',
		// 数据库
		'name'      => getenv('DB_NAME') ?: '',
		// 表名前缀
		'tablepre'  => getenv('DB_PREFIX') ?: 'bx_',
	],
	
	// +----------------------------------------------------------------------
    // | 程序设置
    // +----------------------------------------------------------------------
    
    // 调试模式
    'debug'                  => getenv('APP_DEBUG') === 'true' ?: false,
    // 默认时区
    'default_timezone'       => getenv('APP_TIMEZONE') ?: 'PRC',
    // 程序key
    'key'                    => getenv('APP_KEY') ?: 'unlock',
    
	// +----------------------------------------------------------------------
    // | 模块设置
    // +----------------------------------------------------------------------
    
    // 默认模块名
    'default_module'         => 'index',
    // 默认控制器名
    'default_controller'     => 'Index',
    // 默认操作名
    'default_action'         => 'index',
    
	
	// +----------------------------------------------------------------------
    // | URL设置
    // +----------------------------------------------------------------------
    
    // 路由配置文件（支持配置多个）
    'route_config_file'      => ['route'],
    
];
?>